In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame(np.random.randn(5,4), index=['o','m', 's','p','h'],columns=['one','two','three','four'])

In [3]:
df.head()

        one       two     three      four
o -0.381473  1.655701 -0.383137 -2.786965
m  0.428397 -0.582710  0.560890  0.851763
s -0.261168 -2.327599  0.107110 -0.134745
p  1.870251  1.491089 -1.647773  0.165784
h  1.188170 -0.675576 -0.994172 -0.209715

In [4]:
df2=df.reindex(['a','b','c','d','e','f','g','h'])

In [5]:
df2

       one       two     three      four
a      NaN       NaN       NaN       NaN
b      NaN       NaN       NaN       NaN
c      NaN       NaN       NaN       NaN
d      NaN       NaN       NaN       NaN
e      NaN       NaN       NaN       NaN
f      NaN       NaN       NaN       NaN
g      NaN       NaN       NaN       NaN
h  1.18817 -0.675576 -0.994172 -0.209715

In [6]:
df2.dropna(axis=0)

       one       two     three      four
h  1.18817 -0.675576 -0.994172 -0.209715

In [7]:
pd.isna(df2['one'])

a     True
b     True
c     True
d     True
e     True
f     True
g     True
h    False
Name: one, dtype: bool

In [8]:
df2['one'].notna()

a    False
b    False
c    False
d    False
e    False
f    False
g    False
h     True
Name: one, dtype: bool

In [9]:
df2.fillna('missing')

       one       two     three      four
a  missing   missing   missing   missing
b  missing   missing   missing   missing
c  missing   missing   missing   missing
d  missing   missing   missing   missing
e  missing   missing   missing   missing
f  missing   missing   missing   missing
g  missing   missing   missing   missing
h  1.18817 -0.675576 -0.994172 -0.209715

In [10]:
df2['one'].values

array([       nan,        nan,        nan,        nan,        nan,
              nan,        nan, 1.18816982])